# RoofCurveIsSlopeDefining Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoofCurveIsSlopeDefining Property
ParameterTypeId Class See Also
---
"Defines Roof Slope"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoofCurveIsSlopeDefining { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoofCurveIsSlopeDefining As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoofCurveIsSlopeDefining {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace